import { Color, type Polygon } from './map-2026-geometry-types';

const smallHallPolygons: readonly Polygon[] = [
    {
        points: [
            [0, 300, 100],
            [0, 300, 225],
            [100, 300, 225],
            [100, 300, 140],
            [60, 300, 100],
        ],
        color: Color.red,
    },
    {
        points: [
            [60, 300, 100],
            [100, 300, 140],
            [100, 300, 100],
        ],
    },
];
const courtyardPolygons: readonly Polygon[] = [
    {
        points: [
            [20, 200, -75],
            [20, 100, -110],
            [5, 100, -110],
            [5, 200, -75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-115, 100, -210],
            [-130, 150, -210],
            [-130, 150, -190],
            [-115, 100, -190],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-10, 100, -110],
            [-10, 100, -190],
            [-95, 100, -190],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-130, 150, -190],
            [-145, 150, -190],
            [-145, 200, -75],
            [-130, 200, -75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-130, 200, -35],
            [-145, 200, -35],
            [-145, 150, 75],
            [-130, 150, 75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [20, 150, 75],
            [20, 200, 50],
            [5, 200, 50],
            [5, 150, 75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [25, 90, -150],
            [25, 90, -170],
            [20, 100, -170],
            [20, 100, -150],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [20, 100, -225],
            [20, 90, -250],
            [-20, 90, -250],
            [-20, 100, -225],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [0, 50, -330],
            [0, 50, -360],
            [-50, 50, -350],
            [-50, 50, -300],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [75, 0, -330],
            [75, 0, -380],
            [0, 50, -360],
            [0, 50, -330],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-20, 100, -225],
            [-20, 50, -300],
            [-35, 50, -300],
            [-35, 100, -225],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-35, 50 + 50 * (2 / 3), -250],
            [-35, 50, -300],
            [-50, 50, -300],
            [-50, 50 + 50 * (2 / 3), -250],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-20, 50, -300],
            [-20, 50, -318],
            [-50, 50, -300],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-72, 100, -225],
            [-72, 50, -250],
            [-88, 50, -250],
            [-88, 100, -225],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [5, 100, -110],
            [-10, 100, -110],
            [-10, 0, -75],
            [5, 0, -75],
        ],
    },
    {
        points: [
            [-10, 0, -65],
            [-10, 0, -75],
            [-95, 0, -155],
            [-130, 0, -155],
            [-130, 0, -65],
        ],
    },
];
const gymPolygons: readonly Polygon[] = [
    {
        points: [
            [-60, 0, -425],
            [-60, -100, -500],
            [-100, -100, -500],
            [-100, 0, -425],
        ],
    },
];

const libraryPolygons: readonly Polygon[] = [
    {
        points: [
            [-225, 150, 225],
            [-250, 150, 225],
            [-250, 200, 250],
            [-225, 200, 250],
        ],
    },
    {
        points: [
            [-225, 300, 225],
            [-250, 300, 225],
            [-250, 350, 250],
            [-225, 350, 250],
        ],
    },
];

const bazaarPolygons: readonly Polygon[] = [
    {
        //転心殿前1
        points: [
            [-150, 150, 150],
            [-150, 150, 190],
            [0, 150, 190],
            [0, 150, 150],
        ],
        color: Color.brown,
    },
    {
        //転心殿前2
        points: [
            [-175, 150, 190],
            [-175, 150, 250],
            [0, 150, 250],
            [0, 150, 190],
        ],
        color: Color.brown,
    },
    {
        //高校棟の坂-1
        points: [
            [-175, 150, 250],
            [-175, 150, 475],
            [-110, 150, 475],
            [-110, 150, 250],
        ],
        color: Color.brown,
    },
    {
        //高校棟の坂-2
        points: [
            [-175, 150, 475],
            [-175, 90, 600],
            [-110, 90, 600],
            [-110, 150, 475],
        ],
        color: Color.brown,
    },
    {
        //高校棟の坂-3
        points: [
            [-175, 90, 600],
            [-175, 90, 625],
            [-110, 90, 625],
            [-110, 90, 600],
        ],
        color: Color.brown,
    },
    {
        //高校棟の坂-4
        points: [
            [-175, 90, 625],
            [-175, 30, 750],
            [-110, 30, 750],
            [-110, 90, 625],
        ],
        color: Color.brown,
    },
    {
        //高校棟の坂-5
        points: [
            [-225, 30, 750],
            [-150, 0, 900],
            [-100, 0, 900],
            [-110, 30, 750],
        ],
        color: Color.brown,
    },
    {
        points: [
            [-150, 0, 900],
            [-105, 0, 950],
            [-80, 0, 900],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂
        points: [
            [-100, 150, 250],
            [-60, 130, 400],
            [0, 130, 400],
            [-40, 150, 250],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂(階段用)
        points: [
            [-60, 130, 400],
            [-60, 130, 425],
            [0, 130, 425],
            [0, 130, 400],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂
        points: [
            [-60, 130, 425],
            [-60, 20, 600],
            [0, 20, 600],
            [0, 130, 425],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂 (階段用)
        points: [
            [-60, 20, 600],
            [-60, 20, 625],
            [0, 20, 625],
            [0, 20, 600],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂
        points: [
            [-60, 20, 625],
            [-60, 0, 800],
            [0, 0, 800],
            [0, 20, 625],
        ],
        color: Color.brown,
    },
    {
        //高校棟の坂と中学棟の坂を結ぶ
        points: [
            [-110, 90, 600],
            [-110, 90, 625],
            [-60, 20, 625],
            [-60, 20, 600],
        ],
        color: Color.brown,
    },
    {
        //広場
        points: [
            [-60, 0, 800],
            [-80, 0, 810],
            [-100, 0, 850],
            [-80, 0, 900],
            [-40, 0, 910],
            [0, 0, 900],
            [30, 0, 850],
            [20, 0, 810],
            [0, 0, 800],
        ],
        color: Color.brown,
    },
    {
        //正門・広場間の道
        points: [
            [-80, 0, 900],
            [-130, 0, 1000],
            [-80, 0, 1000],
            [-40, 0, 910],
        ],
        color: Color.brown,
    },
    {
        //図書館棟の前の空間
        points: [
            [-325, 200, 475],
            [-325, 200, 525],
            [-175, 200, 525],
            [-175, 200, 475],
        ],
        color: Color.brown,
    },
    {
        //スロープ横に張り出すキッチンカー用スペース
        points: [
            [-325, 200, 525],
            [-325, 200, 625],
            [-225, 200, 625],
            [-225, 200, 525],
        ],
        color: Color.brown,
    },
    {
        //図書館棟の前と道をつなげる
        points: [
            [-225, 200, 525],
            [-225, 30, 750],
            [-175, 30, 750],
            [-175, 200, 525],
        ],
        color: Color.brown,
    },
    {
        //運動場側の道
        points: [
            [50, 0, 340],
            [50, 0, 870],
            [100, 0, 870],
            [100, 0, 340],
        ],
        color: Color.brown,
    },
    {
        //運動場側の道
        points: [
            [100, 0, 650],
            [200, 0, 450],
            [200, 0, 340],
            [100, 0, 540],
        ],
        color: Color.brown,
    },
    {
        //グラウンド
        points: [
            [200, 0, 340],
            [200, 0, 550],
            [250, 0, 650],
            [350, 0, 650],
            [400, 0, 550],
            [400, 0, 450],
            [350, 0, 340],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂と運動場側を結ぶ階段
        points: [
            [0, 130, 400],
            [0, 130, 425],
            [50, 0, 425],
            [50, 0, 400],
        ],
        color: Color.brown,
    },
    {
        //中学棟の坂と運動場側を結ぶスロープ
        points: [
            [0, 20, 600],
            [0, 20, 625],
            [50, 0, 625],
            [50, 0, 600],
        ],
        color: Color.brown,
    },
    {
        //倉庫前の道
        points: [
            [50, 0, 390],
            [175, 0, 390],
            [200, 0, 340],
            [50, 0, 340],
        ],
        color: Color.brown,
    },
    {
        //運動場側の道と正門を接続する
        points: [
            [20, 0, 920],
            [50, 0, 950],
            [100, 0, 870],
            [50, 0, 870],
        ],
        color: Color.brown,
    },
    {
        //運動場側の道と正門を接続する
        points: [
            [-70, 0, 977.5],
            [50, 0, 950],
            [20, 0, 920],
            [-55, 0, 943.75],
        ],
        color: Color.brown,
    },
];

/** 多角形
 *  points: 頂点 ([x座標, y座標, z座標]のタプル) を反時計回りに並べた配列
 *  color: 表面の色(省略した場合は白)
 * */
export const polygons: readonly Polygon[] = [
    ...smallHallPolygons,
    ...courtyardPolygons,
    ...gymPolygons,
    ...libraryPolygons,
    ...bazaarPolygons,
];

